Repository: KIV-ASWI-PL2014/Director
Catalog: Director/Properties/Resources.*.resx
Languages: cs

source: Authorization
cs: Autorizace

source: Authorization settings
cs: Nastavení autorizace

# ContextMenuAddRequest
source: Add request
cs: Přidat požadavek

# ContextMenuRemoveRequest
source: Remove request
cs: Odstranit požadavek

# ContextMenuRemoveScenario
source: Remove scenario
cs: Odstranit scénář

# DialogOpenScenario
source: Select scenario file
cs: Vybrat scénář

source: Email notifications
cs: Oznámení emailem

source: Errors
cs: Chyby

source: Every 10 minutes
cs: Každých 10 minut

source: Every 12 hours
cs: Každých 12 hodin

source: Every 30 minutes
cs: Každých 30 minut

source: Every 3 hours
cs: Každé 3 hodiny

source: Every 5 minutes
cs: Každých 5 minut

source: Every 6 hours
cs: Každých 6 hodin

source: Every day
cs: Každý den

source: Every hour
cs: Každou hodinu

# ExportDialog
source: Export scenarios
cs: Export scénářů

# InvalidScenarioName
source: Invalid scnario name!
cs: Nesprávné jméno scénáře!

# InvalidServerName
source: Server name cannot be empty!
cs: Jméno serveru nesmí být prázdné!

source: Invalid server url!
cs: Nesprávná URL serveru!

# MenuAddScenario
source: Add scenario
cs: Přidat scénář

# MenuExitProgram
source: Exit
cs: Konec

# MenuNewServer
source: New server
cs: Nový server

# MenuOpenScenario
source: Open scenario
cs: Otevřít scénář

# MenuSaveServer
source: Save server
cs: Uložit server

# MessageBoxRemoveScenario
source: Are you sure you want to remove this scenario?
cs: Opravdu chcete odebrat tento scénář?

# NewScenarioName
source: New scenario
cs: Nový scénář

# NewServerString
source: New server
cs: Nový server

source: Notification
cs: Oznámení

source: Password
cs: Heslo

# RequestInfoBox
source: Request
cs: Požadavek

# RunningPeriodicity
source: Default running periodicity
cs: Implicitní periodicita spouštění

# ScenarioInfoBox
source: Scenario
cs: Scénář

# ScenarioName
source: Name
cs: Jméno

source: Scenario settings
cs: Nastavení scénářů

source: Server name
cs: Jméno serveru

source: Server settings
cs: Nastavení serveru

# ServerURL
source: Default server URL
cs: Implicitní URL serveru

# TreeStoreInformation
source: Information
cs: Informace

source: Username
cs: Uživatelské jméno

# DialogSaveScenario
source: Save scenario
cs: Uložit scénář

# NoScenarioSelected
source: Please select at least one scenario to export!
cs: Prosím vyberte alespoň jeden scénář!

# OutputFileNotSelected
source: Please select output file!
cs: Prosím vyberte cílový soubor!

# SaveServer
source: Save
cs: Uložit

# SelectAll
source: Select all scenarios
cs: Vybrat všechny scénáře

# SelectScenarios
source: Select scenarios to export
cs: Vyberte scénáře k exportu

# ChooseRunningOptions
source: Choose running option
cs: Vyber volby spuštění

# Confirm
source: Close
cs: Zavřít

# FrequencyLabel
source: Frequency
cs: Frekvence

# InvalidRequestName
source: Request name is invalid!
cs: Nesprávné jméno požadavku!

# InvalidTimeDelay
source: Time delay must be a number and greather or equal to 0!
cs: Čas odložení musí být číslo větší nebo rovno 0!

# MenuEditRequest
source: Edit request
cs: Upravit požadavek

source: Request name
cs: Jméno požadavku

# RequestRequest
source: Request specification
cs: Specifikace požadavku

# RequestResponse
source: Response specification
cs: Specifikace odpovědi

source: Request settings
cs: Nastavení požadavku

# RunningOptionsLabel
source: Running options
cs: Volby spuštění

# ScenarioLabel
source: Scenario
cs: Scénář

source: Scenario overview
cs: Přehled scénářů

source: Time delay in seconds
cs: Čas odložení v sekundách

# TimeDelayLabel
source: Time delay after previous scenario
cs: Čas odložení po dokončení předchozího scénáře

# MenuCopyRequest
source: Copy request
cs: Zkopírovat požadavek

# MenuCopyScenario
source: Copy scenario
cs: Zkopírovat scénář

# MenuEditDefaultHeaders
source: Edit default headers
cs: Upravit implicitní hlavičku

# MenuPasteRequest
source: Paste request
cs: Vložit požadavek

# MenuPasteScenario
source: Paste scenario
cs: Vložit scénář

# ErroInvalidRequest
source: Invalid request URL!
cs: Nesprávné URL požadavku!

# HeaderHeaderType
source: Type:
cs: Typ:

# HeaderHeaderValue
source: Value:
cs: Hodnota:

# NoRequestMethod
source: Not set
cs: Nevyplněno

# RequestFiles
source: Files
cs: Soubory

# RequestHeaders
source: Headers
cs: Hlavičky

# RequestMethod
source: Method
cs: Metoda

# RequestOverview
source: Overview
cs: Přehled

# RequestTab
source: Request
cs: Požadavek

# ResposneTab
source: Response
cs: Odpověď

# DefaultServerHeaders
source: Default headers
cs: Implicitní hlavičky

source: Expected status code
cs: Očekávaný status kód

source: File name
cs: Jméno souboru

# FileNameAlreadyExists
source: This name of file already exists!
cs: Soubor s tímto jménem již existuje!

source: File path
cs: Cesta k souboru

# MessageBoxRemoveRequest
source: Are you sure you want to remove this request?
cs: Opravdu chcete odebrat tento požadavek?

# OrderDOWN
source: DOWN
cs: DOLŮ

# OrderUP
source: UP
cs: NAHORU

# DialogInvalidFile
source: Invalid Director file!
cs: Nesprávný Director soubor!

# AboutMenu
source: About
cs: Nápověda

# ConfirmInput
source: Confirm
cs: Potvrdit

# EditContent
source: Set content
cs: Změnit obsah

# HelpMenu
source: Help
cs: Nápověda

# HelpMenuItem
source: Help
cs: Nápověda

source: Invalid status code
cs: Nesprávný status kód

# InvalidWaitTime
source: Invalid time!
cs: Nesprávný čas!

# MenuCloseScenario
source: Close scenario
cs: Zavřít scénář

# MenuRun
source: Run
cs: Spustit

# MessageBoxCloseScenario
source: Do you want to close scenario?
cs: Chcete zavřít scénář?

source: Request content:
cs: Obsah požadavku:

source: Response content
cs: Obsah odpovědi

# RunAllMenu
source: Run all!
cs: Spustit vše!

# SetContentTitle
source: Set request or response
cs: Změň požadavek nebo odpověď

# SettingsMenu
source: Settings
cs: Nastavení

# WaitPreviousRequest
source: Wait in seconds after sucessfull previous request:
cs: Čas čekání po předchozím úspěšném požadavku v sekundách

# PARSER_ERR_MSG_ARGUMENTS_WRONG_SIZED
source: Argument no. {0} ("{1}") must be smaller than argument no. {2} ("{3}").
cs: Argument č. {0} ("{1}") musí být menší než argument č. {2} ("{3}").

# PARSER_ERR_MSG_ARGUMENT_INVALID
source: Argument "{0}" is invalid.
cs: Argument "{0}" je neplatný.

# PARSER_ERR_MSG_ARGUMENT_NOT_FLOAT
source: Argument "{0}" is not a valid float.
cs: Argument "{0}" není validní float.

# PARSER_ERR_MSG_ARGUMENT_NOT_INTEGER
source: Argument "{0}" is not a valid integer.
cs: Argument "{0}" není validní integer.

# PARSER_ERR_MSG_ARGUMENT_TOO_BIG
source: Argument "{0}" is too big of a number.
cs: Argument "{0}" je příliš velké číslo.

# PARSER_ERR_MSG_COMPARE_OPERATION
source: Operation "{0} {1} {2}" returned false.
cs: Operace "{0} {1} {2}" vrátila false.

# PARSER_ERR_MSG_COMPARE_TYPES
source: Types "{0}" defined in template and "{1}" received in response don't match.
cs: Typy "{0}" definované v šabloně a "{1}" obdržené v odpovědi se neshodují.

# PARSER_ERR_MSG_COMPARE_VALUES
source: Values "{0}" defined in template and "{1}" received in response don't match.
cs: Hodnoty "{0}"definované v šabloně a "{1}" obdržené v odpovědi se neshodují.

# PARSER_ERR_MSG_EXPECTING_CHARACTER
source: Expecting "{0}".
cs: Očekáváno "{0}".

# PARSER_ERR_MSG_FN_INSIDE_VAR
source: Illegal function definition inside variable name.
cs: Neplatná definice funkce uvnitř jména proměnné.

# PARSER_ERR_MSG_ILLEGAL_KEY_IN_RESPONSE
source: Response JSON contains "{0}" key, that is not defined in the template.
cs: Odpověď JSON obsahuje "{0}" klíč, který není definovaný v šabloně.

# PARSER_ERR_MSG_INVALID_CHARACTER
source: Invalid character "{0}".
cs: Nesprávný znak "{0}".

# PARSER_ERR_MSG_INVALID_NUMBER_OF_ARGUMENTS
source: Invalid number of arguments.
cs: Nesprávný počet argumentů.

# PARSER_ERR_MSG_MISING_TYPE_FOR_OPERATION
source: Missing type for operation. If you want to compare the value, type must be specified.
cs: Chybí typ pro vykonání operace. Pokud chcete porovnat hodnotu, musí být specifikovaný typ.

# PARSER_ERR_MSG_MISSING_FN_NAME
source: Missing function name.
cs: Chybí jméno funkce.

# PARSER_ERR_MSG_MISSING_KEY_IN_RESPONSE
source: Response JSON does not contain "{0}" key, that is defined as mandatory in the template.
cs: Odpověď JSON neobsahuje "{0}" klíč, který je v šabloně definovaný jako povinný.

# PARSER_ERR_MSG_MISSING_MAIN_SYNTAX_CHARACTER
source: Missing closing function character ({0}). Either provide one or escape this one like {1} .
cs: Chybí znak ({0}) ukončující funkci. Je potřeba ho doplnit nebo escapovat tento {1} .

# PARSER_ERR_MSG_MISSING_VARIABLE_CHARACTER
source: Missing closing variable character ({0}). Either provide one or escape this one like {1} .
cs: Chybí znak ({0}) ukončující proměnnout. Je potřeba ho doplnit nebo escapovat tento {1} .

# PARSER_ERR_MSG_OPERATION_DOESNT_SUPPORT_TYPE
source: Operation "{0}" does not support "{1}" type.
cs: Operace "{0}" nepodporuje "{1}" typ.

# PARSER_ERR_MSG_REGEX_PARSER
source: Regular expression parser raised following exception: {0}
cs: Při parsování regulárního výrazu došlo k následující chybě: {0}

# PARSER_ERR_MSG_SWAPPED_PARENTHESES
source: Possible swapped parentheses - "{0}" must be closed with "{1}".
cs: Možná záměna závorek - "{0}" musí být uzavřena pomocí "{1}".

# PARSER_ERR_MSG_UNKNOWN_CUSTOM_VARIABLE
source: Variable "{0}" is not defined.
cs: Proměnná "{0}" není definovaná.

# PARSER_ERR_MSG_UNKNOWN_OPERATION
source: Unknown operation type "{0}".
cs: Neznámý typ operace "{0}".

# PARSER_ERR_MSG_UNKNOWN_TYPE
source: Unknown type "{0}".
cs: Neznámy typ "{0}".

# PARSER_ERR_MSG_UNRECOGNIZED_CHARS_AFTER_FN
source: Unrecognized characters after defined function.
cs: Nerozeznýny znaky za definicí funkce.

# PARSER_ERR_MSG_UNRECOGNIZED_FN
source: Unrecognized function.
cs: Nerozeznána funkce.

# PARSER_ERR_MSG_VALUES_DIFFER_IN_TYPE
source: Values for matched key "{0}" differ in their type ("{1}" and "{2}").
cs: Hodnoty pro klíč "{0}" se liší v typu ("{1}" a "{2}").

# PARSER_ERR_MSG_VALUE_UNCONVERTABLE_TO_TYPE
source: Provided value "{0}" couldn't be converted to "{1}" type.
cs: Poskytnutá hodnota "{0}" nemůže být převedena na "{1}" typ.

source: Error
cs: Chyba

# InvalidReturnCode
source: Expected: {0} code but request ends with: {1}.
cs: Očekáván: {0} kód, ale požadavek skončil: {1}.

# RequestNotSuccessfull
source: Request was not successfull ({0})!
cs: Požadavek nebyl úspěšný ({0})!

source: Response
cs: Odpověď

source: Result body
cs: Tělo odpovědi

# ResultIsOk
source: Request is OK
cs: Požadavek je v pořádku

source: Language
cs: Jazyk

# RestartApp
source: For apply changes, you have to restart application!
cs: Pro zobrazení změn je třeba restartovat aplikaci!

# About
source: About Director
cs: O Direktoru

source: Authors
cs: Autoři

source: Close
cs: Zavřít

# HomepageUrl
source: Homepage
cs: Domovská stránka

source: Informations
cs: Informace

source: Version
cs: Verze

source: Cancel
cs: Zrušit

source: Example
cs: Příklad

# HeaderSettings
source: Expression creator
cs: Vytvoření výrazu

# NoVariablesFound
source: There are no variables in this scenario, make please a new one from successfull request!
cs: Nenalezeny žádné proměnné ve scénáři, prosím vytvořte nové z úspěšného požadavku.

source: Text after
cs: Text za

source: Text before
cs: Text před

source: Variable
cs: Proměnná

# Icons
source: Icons by
cs: Ikony od

# InputPrompt
source: Paste input:
cs: Vložit vstup:

# OutputMessage
source: Output:
cs: Výstup:

source: Edit variable
cs: Změnit proměnnou

source: Format directive
cs: Formátovací direktiva

source: Format guide
cs: Průvodce formátování

# InvalidNumberInput
source: Input has to be number!
cs: Na vstupu je očekáváno číslo!

# JsonValue
source: Value
cs: Hodnota

source: Output:
cs: Výstup:

source: Paste input:
cs: Vložit vstup:

source: Request template
cs: Šablona požadavku

source: Response template
cs: Šablona odpovědi

# CopyInClipboard
source: Copy
cs: Zkopírovat

# NoResponse
source: No response yet, run scenario first!
cs: Zatím žádná odpověd, je třeba spustit scénář!

source: Requests
cs: Požadavky

source: Run scenario
cs: Spustit scénář

source: Variables
cs: Proměnné

# Wait
source: waiting
cs: čekání

# CanNotStartScenario
source: Cannot start next scenario, wait until previous finished!
cs: Nelze spustit následující scénář, čeká se na dokončení předchozího.

source: Error when generating template
cs: Chyba při generování šablony

source: Stop
cs: Zastavit

# ExportDeserialScenariosEx
source: Exception during deserialization of scenarios:
cs: Chyba během deserializace scénářů:

# ExportDeserialServerEx
source: Exception during deserialization of server:
cs: Chyba během deserializace serveru:

# ExportProcessFilesEx
source: Exception during processing files:
cs: Chyba během zpracování souborů:

# ExportProcessTempDirEx
source: Exception during processing temporary directory:
cs: Chyba během manipulace s temporárním adresářem:

# ExportSerialScenariosEx
source: Exception during serialization of scenarios:
cs: Chyba během serializace scénářů:

# ExportSerialServerEx
source: Exception during serialization of server:
cs: Chyba během serializace serveru:

# ExportSkipFileWarning
source: File {0} in request {1} in scenario {2} has been skipped.\n
cs: Soubor {0} v požadavku {1} ve scénáři {2} byl přeskočen.\n

# ExportZipCompressionEx
source: Exception during a zip compression:
cs: Chyba během zip komprese:

# ExportZipDecompressionEx
source: Exception during a zip decompression:
cs: Chyba během zip dekomprese:

# NewRequestName
source: New request
cs: Nový požadavek

source: Export result
cs: Výsledek exportu

source: Import result
cs: Výsledek importu

# ErrorExportVariables
source: Error has occured, when exporting variables, try it again!
cs: Při exportu se stala chyba, zkuste to prosím znovu!

# ExportVariablesStates
source: Export variables
cs: Exportovat stavy proměnných

# VariableExportSuccess
source: Export was successfull!
cs: Export byl úspěšný!

# ErrorGeneratingUrl
source: Error occured, when generating URL
cs: Chyba při generování URL

# ErrorWhenGeneratingHeaders
source: Error occured, when generating headers
cs: Chyba při generování hlaviček

# ButtonRunAndSave
source: Save and run
cs: Ulož a spusť

# ButtonSave
source: Save
cs: Uložit

# ButtonStorno
source: Cancel
cs: Zrušit

source: Import
cs: Importovat

# ImportApiary
source: Import from Apiary(snowcrash)
cs: Importovat z Apiary(snowcrash)

# ImportPostman
source: Import from Postman
cs: Importovat z Postmana

# InfoApiarySnowcrash
source: In next dialog, please select ApiaryJson file, which can be created by Snowcrash utility! (snowcrash source.blueprint -o source.json -f json)
cs: V dalším dialogu prosím vyberte Apiary JSON soubor, který může být snadno vygenerován přiloženou utilitou snowcrash (snowcrash source.blueprint -o source.json -f json).

source: Select json file
cs: Vyberte JSON soubor

# SetVariables
source: Set start variables
cs: Nastavit počáteční proměnné

source: Condition value:
cs: Hodnota podmínky:

# EvalCondIfParIsPresent
source: Evaluate condition if parameter is present
cs: Vyhodnoť podmínku pokud je parametr přítomen

source: Format type:
cs: Typ formátu:

source: Operation:
cs: Operace:

# OperationEquals
source: Equals
cs: Rovná se

# OperationGreatherThan
source: Greather than
cs: Větší než

# OperationGreatherThanOrEqual
source: Greather than or equal
cs: Větší než nebo rovno

# OperationLessThan
source: Less than
cs: Menší než

# OperationLessThanOrEquals
source: Less than or equal
cs: Menší než nebo rovno

# OperationNotEquals
source: Not equals
cs: Nerovná se

source: Save to variable:
cs: Ulož do proměnné:

# UseVarInsteadOfValue
source: Use variable instead of value
cs: Použij proměnnou namísto hodnoty
